Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/social_welfare/social_welfare_payments/social_welfare_payments_to_families_and_children/back_to_work_family_dividend.html.txt.tmx
Source language: en
Languages: ga

source: Back to Work Family Dividend
ga: An Díbhinn Teaghlaigh um Fhilleadh ar Obair

source: The Back to Work Family Dividend (BTWFD) scheme aims to help families to move from social welfare into employment
ga: Tá de chuspóir ag scéim na Díbhinne Teaghlaigh um Fhilleadh ar Obair (DTFAO) cabhrú le teaghlaigh aistriú ó leas sóisialach isteach san fhostaíocht

source: It gives financial support to people with qualified children who are in or take up employment or self-employment and as a result stop claiming a jobseeker's payment or a one-parent family payment on or after 5 January 2015
ga: Tugann an díbhinn tacaíocht airgeadais do dhaoine a bhfuil leanaí cáilithe acu atá fostaithe nó féinfhostaithe nó a ghlacann le fostaíocht nó le féinfhostaíocht agus mar thoradh air sin, a chuireann stop le híocaíocht chuardaitheora poist nó íocaíocht teaghlach aontuismitheora a éileamh an 5 Eanáir 2015 nó ina dhiaidh sin

source: You will be paid the equivalent of any Increases for Qualified Children that were being paid on your jobseeker or one-parent family payment (up to a maximum of 4 children) for the first year in employment
ga: Chun cáiliú, ní mór duitse, agus gach duine muinteartha i do theaghlach (do dhuine fásta cleithiúnach san áireamh) díshíniú de gach buníocaíocht leasa shóisialaigh a fháil

source: To qualify, you and all members of your family (including your adult dependant) must sign off all primary social welfare payments
ga: Ní féidir an Díbhinn Teaghlaigh um Fhilleadh ar Obair a íoc le Forlíonadh Ioncam Teaghlaigh agus roinnt íocaíochtaí leasa shóisialaigh neamhphríomha eile

source: The Back to Work Family Dividend can be paid with Family Income Supplement and some other non-primary social welfare payments. You can also claim certain short-term illness and injury benefits with BTWFD for up to 36 days (see 'Other payments and BTWFD' below)
ga: Féadfaidh tú sochair breoiteachta gearrthéarmaí agus díobhálacha a éileamh, chomh maith, leis an DTFAO ar feadh a fhad le 36 lá (féach ‘Íocaíochtaí eile agus an DTFAO’ thíos)

source: The habitual residence condition applies to BTWFD
ga: Baineann coinníoll an ghnáthchónaithe leis an DTFAO

source: You may be eligible for the Back to Work Family Dividend (BTWFD) if you have at least one qualified child and are getting one of the following payments:
ga: D’fhéadfá a bheith i dteideal an Díbhinn Teaghlaigh um Fhilleadh ar Obair (DTFAO) a fháil má tá leanbh cáilithe amháin, ar a laghad agat, agus má tá ceann amháin de na híocaíochtaí a leanas á bhfáil agat:

source: • Jobseeker’s Allowance or Jobseeker’s Benefit for at least 12 months (312 days of unemployment) of which at least 6 months (156 days of unemployment) must have been in the last year
ga: • Liúntas Cuardaitheora Poist nó Sochar Cuardaitheora Poist ar feadh 12 mhí (312 lá dífhostaíochta), ar a laghad, a raibh 6 mhí (156 lá dífhostaíochta) den tréimhse sin i gceist le bliain anuas

source: • One-Parent Family Payment (OFP)
ga: • Íocaíocht Teaghlach Aontuismitheora (ÍTA)

source: • Jobseeker’s Transitional payment (paid to people who are not cohabiting with children aged between 7 and 13 years)
ga: • Liúntas Cuardaitheora Poist (Aistriú) (a íoctar le daoine nach bhfuil ag comhchónaí a bhfuil leanaí acu idir 7 agus 13 bliana d’aois)

source: You can combine time on a jobseeker’s payment with time spent on education, training or employment schemes to meet the eligibility requirements
ga: Féadfaidh tú an t-am a chaitear le híocaíocht chuardaitheora poist a fháil a chur san áireamh leis an am a caitheadh ar scéimeanna oideachais, oiliúna nó dífhostaíochta chun na ceanglais cháilitheachta a chomhlíonadh

source: If you went from a qualifying payment to an education, training or employment scheme and then find work you can go directly onto the BTWFD scheme without having to sign back onto your original payment
ga: Má d’aistrigh tú ó íocaíocht cháilitheach go dtí scéim oideachais, oiliúna nó fostaíochta agus má aimsíonn tú obair ina dhiaidh sin, féadfaidh tú bheith rannpháirteach láithreach bonn i scéim an DTFAO gan síniú le d’íocaíocht bhunaidh

source: You must exit one of the qualifying payments or schemes to qualify for BTWFD
ga: Ní mór duit scor de cheann amháin de na híocaíochtaí nó na scéimeanna cáilitheacha chun cáiliú don DTFAO

source: If you are not already in insurable employment or self-employment you must take up employment within 4 weeks of leaving your original payment or scheme. The employment must be in the State
ga: Mura bhfuil tú i bhfostaíocht nó féinfhostaíocht inárachais cheana féin, ní mór duit glacadh le fostaíocht laistigh de 4 seachtaine tar éis d’íocaíocht nó scéim bhunúil a fhágáil

source: Note that if you were employed or self-employed and were getting OFP and your OFP has stopped because your youngest child has reached the age limit you may be eligible for BTWFD – if you do not sign onto another primary social welfare payment
ga: Tabhair faoi deara, má bhí tú fostaithe nó féinfhostaithe agus má bhí ÍTA á fháil agat agus má cuireadh stop le do ÍTA mar gheall gur bhain do leanbh is óige an aoisteorainn amach, b’fhéidir go mbeidh tú incháilithe an DTFAO a fháil – mura gcláraíonn tú do bhuníocaíocht leasa shóisialaigh eile

source: The Back to Work Family Dividend can be paid with Family Income Supplement (FIS) and is not taken into account in the means test for FIS
ga: Is féidir an Díbhinn Teaghlaigh um Fhilleadh ar Obair a íoc leis an bhForlíonadh Ioncam Teaghlaigh (FIT) agus ní chuirtear í san áireamh sa tástáil mhaoine don FIT

source: It can also be paid if you are getting an Increase for a Qualified Adult on your payment for your spouse, civil partner or cohabitant and they find work (and as a result you sign off your payment)
ga: Anuas air sin, is féidir í a íoc le Méadú do Dhuine Fásta Cáilithe ar d’íocaíocht do do chéile, páirtnéir sibhialta nó do chomháitritheoir agus má aimsíonn siad obair

source: However, you must meet all the conditions above and the Back to Work Family Dividend will be paid to you (as the recipient of the primary social welfare payment)
ga: Ní mór duitse, áfach, na coinníollacha thuas a chomhlíonadh agus íocfar an Díbhinn Teaghlaigh um Fhilleadh ar Obair leat (mar fhaighteoir na buníocaíochta leasa shóisialaigh)

source: Other payments and BTWFD
ga: Íocaíochtaí eile agus an DTFAO

source: You are not eligible for BTWFD if you or your spouse, civil partner or cohabitant is getting a primary social welfare payment or is on an employment or training scheme
ga: Níl tú i dteideal an DTFAO a fháil má tá buníocaíocht leasa shóisialaigh á fáil agatsa nó ag do chéile, páirtnéir sibhialta nó comháitritheoir nó má tá páirt á glacadh acu i scéim fostaíochta nó oiliúna

source: You cannot get BTWFD for a child on whose behalf an IQC or IQA is being paid or who is getting a payment in their own right
ga: Ní féidir leat DTFAO a fháil do leanbh a n-íoctar Méadú do Leanbh Cáilithe nó Méadú do Dhuine Fásta Cáilithe thar a gceann nó a bhfuil íocaíocht á fáil acu ina gceart féin

source: BTWFD is not paid together with the Back to Work Enterprise Allowance
ga: Ní íoctar an DTFAO i dteannta an Liúntais Fiontraíochta um Fhilleadh ar Obair

source: BTWFD can be paid with the following payments (to you or your spouse, civil partner or cohabitant):
ga: Is féidir an DTFAO a íoc leis na híocaíochtaí a leanas (leatsa nó le do chéile, páirtnéir sibhialta nó comháitritheoir):

source: • Back to School Clothing and Footwear Allowance
ga: • Liúntas Éadaí agus Coisbhirt chun Filleadh ar Scoil

source: • Disablement Benefit and Death Benefit (under the OIB scheme)
ga: • Sochar Míthreorach agus Sochar Báis (faoi scéim an SDC)

source: • Exceptional and Urgent Needs payments under the SWA scheme
ga: • Íocaíochtaí ar Riachtanais Eisceachtúla agus Práinneacha faoi scéim an LLF

source: • Illness Benefit and Injury Benefit (under the OIB scheme) for 36 days
ga: • Sochar Breoiteachta agus Sochar Díobhála (faoi scéim an SDC) ar feadh 36 lá

source: • Widowed or Surviving Civil Partner Grant
ga: • Deontas Baintrí, Baintreach Fir nó Páirtnéara Shibhialta Mharthanaigh

source: BTWFD is not assessed as means for Rent Supplement
ga: Ní dhéantar measúnú ar an DTFAO mar mhaoin le haghaidh Forlíonadh Cíosa

source: You can claim BTWFD and Illness Benefit or Injury Benefit (under the OIB scheme) for 36 days (6 weeks)
ga: Féadfaidh tú an DTFAO agus Sochar Breoiteachta nó Sochar Díobhála (faoi scéim an SDC) a éileamh ar feadh 36 lá (6 seachtaine)

source: Your BTWFD will be suspended after the 36th day of your Illness or Injury Benefit claim
ga: Cuirfear do DTFAO ar fionraí i ndiaidh an 36ú lá de d’éileamh ar Shochar Breoiteachta nó Díobhála

source: BTWFD will last for up to 2 years, if you remain in employment
ga: Mairfidh an DTFAO ar feadh 2 bhliain, ar a mhéid, a fhad agus a fhanann tú san fhostaíocht

source: If you claim a primary social welfare payment at any time within the 2-year period, the BTWFD payment will stop
ga: Má éilíonn tú íocaíocht leasa shóisialaigh ag aon tráth laistigh den tréimhse dhá bhliain, cuirfear deireadh leis an DTFAO

source: If your spouse, civil partner or cohabitant claims a payment the BTWFD payment will also stop
ga: Má éilíonn do chéile nó do pháirtnéir íocaíocht, cuirfear deireadh le híocaíocht an DTFAO, chomh maith

source: If you lose your job and claim a social welfare payment the BTWFD stops but it may restart if you get a new job – to a maximum of 2 restarts per claim
ga: Má chailleann tú do phost agus má éilíonn tú íocaíocht leasa shóisialaigh, cuirfear deireadh leis an DTFAO ach d’fhéadfaí í a atosú má fhaigheann tú post nua – ceadaítear a mhéid le 2 atosú in aghaidh an éilimh

source: BTWFD is based on the standard Increase for a Qualified Child (IQC) rate of €29.80
ga: Tá an DTFAO bunaithe ar ráta caighdeánach €29.80 an Mhéadaithe do Leanbh Cáilithe (MLC)

source: If you were getting a half-rate IQC with your payment you will get a standard rate BTWFD
ga: Má bhí MLC ar leathráta á fháil agat le d’íocaíocht, gheobhaidh tú DTFAO ar ráta caighdeánach

source: There is a ceiling of €119.20 per week (4 children)
ga: Tá uasteorainn €119.20 sa tseachtain ann (4 leanbh)

source: You will be paid weekly by Electronic Funds Transfer (EFT) in arrears
ga: Íocfar thú gach seachtain trí Ríomhaistriú Airgid (EFT) i riaráistí

source: BTWFD is not taxable
ga: Níl an DTFAO incháinithe

source: Contact your Intreo centre or local social welfare office to get more information on the scheme
ga: Déan teagmháil le d’ionad Intreo nó le d’oifig áitiúil leasa shóisialaigh chun breis faisnéise a fháil ar an scéim

source: They will explain how the application process works and give you the application form
ga: Míneoidh siad duit conas a oibrítear an próiseas iarratais agus tabharfaidh siad an fhoirm iarratais duit

source: You can also get the form online (pdf)
ga: Féadfaidh tú an fhoirm a fháil ar líne, chomh maith (pdf)

source: You can appeal a decision on your claim to the Social Welfare Appeals Office
ga: Féadfaidh tú cinneadh ar d’éileamh a achomharc leis an Oifig Achomhairc Leasa Shóisialaigh

source: The last day for new BTWFD applications will be 31 March 2018
ga: An 31 Márta 2018 a bheidh ar an lá deireanach chun iarratais a sheoladh ar an DTFAO nua

source: The scheme will end on 31 March 2021
ga: Cuirfear deireadh leis an scéim an 31 Márta 2021

source: You are generally paid BTWFD from the date of your claim
ga: Is gnách go n-íoctar an DTFAO leat ó dháta d’éilimh

source: Deciding officers can backdate BTWFD for up to 6 months from your claim if there was good cause for the delay
ga: Féadfaidh oifigigh bhreithiúnachta an DTFAO a shiardhátú ar feadh a fhad le 6 mhí ó d’éileamh má bhí údar maith leis an moill

source: Send your application for the Back to Work Family Dividend to your Intreo centre or local social welfare office
ga: Seol d’iarratas ar an Díbhinn Teaghlaigh um Fhilleadh ar Obair chuig d’ionad Intreo nó d’oifig áitiúil leasa shóisialaigh
